tap "1password/tap"
tap "codeship/taps"
tap "homebrew/bundle"
tap "homebrew/services"
tap "stripe/stripe-cli"
tap "universal-ctags/universal-ctags"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Framework for layout and rendering of i18n text
brew "pango"
# Multipurpose sniffer/interceptor/logger for switched LAN
brew "ettercap"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Libraries for security-enabled client and server applications
brew "nss"
# File browser
brew "ranger"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line tool for Stripe
brew "stripe-cli"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Command-line interface for 1Password
cask "1password-cli"
# GPU-accelerated terminal emulator
cask "alacritty"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
# CI/CD as a service
cask "jet"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Video chat, voice call and instant messaging application
cask "skype"
# JavaScript IDE
cask "webstorm"
# Native desktop client for WhatsApp
cask "whatsapp"
vscode "aki77.rails-db-schema"
vscode "aliariff.vscode-erb-beautify"
vscode "bradlc.vscode-tailwindcss"
vscode "calebporzio.better-keybindings"
vscode "calebporzio.simple-project-switcher"
vscode "coachrichbart.better-jest"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "huff-language.huff-language"
vscode "juanblanco.solidity"
vscode "junstyle.php-cs-fixer"
vscode "kaiwood.endwise"
vscode "karunamurti.haml"
vscode "koichisasada.vscode-rdbg"
vscode "misogi.ruby-rubocop"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "naumovs.color-highlight"
vscode "nur.just-black"
vscode "rebornix.toggle"
vscode "ritwickdey.liveserver"
vscode "sanity-io.vscode-sanity"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "whizkydee.material-palenight-theme"
