tap "1password/tap"
tap "codeship/taps"
tap "guumaster/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "moncho/dry"
tap "ngrok/ngrok"
tap "nikitabobko/tap"
tap "stripe/stripe-cli"
tap "universal-ctags/universal-ctags"
tap "wix/brew"
# Library for manipulating PNG images
brew "libpng"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# YAML Parser
brew "libyaml"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Multipurpose sniffer/interceptor/logger for switched LAN
brew "ettercap"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Geometry Engine
brew "geos"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Toolkit for creating graphical user interfaces
brew "gtk4"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# QUIC transport protocol implementation
brew "mvfst"
# Open source relational database management system
brew "mysql@8.0", link: true
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast, disk space efficient package manager
brew "pnpm"
# File browser
brew "ranger"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Rust toolchain installer
brew "rustup"
# Soak up standard input and write to a file
brew "sponge"
# Command-line tool for Stripe
brew "stripe-cli"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Your dev tool to manage /etc/hosts like a pro
brew "guumaster/tap/hostctl"
# a Docker manager for the terminal
brew "moncho/dry/dry"
# Apple simulator utilities
brew "wix/brew/applesimutils", args: ["HEAD"]
# Command-line interface for 1Password
cask "1password-cli"
# GPU-accelerated terminal emulator
cask "alacritty"
# Tools for building Android applications
cask "android-studio"
# App to build and share containerised applications and microservices
cask "docker"
# Collaborative team software
cask "figma"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
# CI/CD as a service
cask "jet"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Standalone app for debugging React Native apps
cask "react-native-debugger"
# Desktop app for inspecting React JS and React Native projects
cask "reactotron"
# Video chat, voice call and instant messaging application
cask "skype"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Open-source code editor
cask "visual-studio-code"
# JavaScript IDE
cask "webstorm"
# Native desktop client for WhatsApp
cask "whatsapp"
vscode "aki77.rails-db-schema"
vscode "aliariff.vscode-erb-beautify"
vscode "bradlc.vscode-tailwindcss"
vscode "coachrichbart.better-jest"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "huff-language.huff-language"
vscode "juanblanco.solidity"
vscode "junstyle.php-cs-fixer"
vscode "kaiwood.endwise"
vscode "karunamurti.haml"
vscode "koichisasada.vscode-rdbg"
vscode "misogi.ruby-rubocop"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "naumovs.color-highlight"
vscode "nur.just-black"
vscode "rebornix.toggle"
vscode "ritwickdey.liveserver"
vscode "sanity-io.vscode-sanity"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "whizkydee.material-palenight-theme"
